# ContextualHelp Class

---
Contains the details for how Revit should allow invocation of contextual help for an item added by an application.
SystemObject Autodesk.Revit.UIContextualHelp
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class ContextualHelp

    Public Class ContextualHelp

    public ref class ContextualHelp

    type ContextualHelp = class end
The ContextualHelp type exposes the following members.
| Name| Description
---|---|---
| ContextualHelp| Constructs a contextual help object.
Top
| Name| Description
---|---|---
| HelpPath| The context id, help URL, or help file path.
| HelpTopicUrl| The help topic URL.
| HelpType| The contextual help type.
Top
| Name| Description
---|---|---
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| Launch| Launches and displays the help topic specified by the contents of this ContextualHelp object.
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
An instance of this class may be used to assign a contextual help location to any RibbonItem (through the RibbonItem.SetContextualHelp() method). It is also possible to use an instance of this class to launch the help path and topic at any time (this permits association of help topics with user interface components inside dialogs created by the add-in application).
#### Reference
Autodesk.Revit.UI Namespace